/********************************************************************************************************************
 * 문자열에 숫자, -, +, . 만 포함되어 있는지 확인하는 함수
 * @param v 확인할 값
 * @param allowComma 콤마(,)를 허용할지 여부 (기본값: false)
 * @returns 숫자만 포함되어 있으면 true, 그렇지 않으면 false 반환
 * ******************************************************************************************************************/
export function isNumericText(v: string, allowComma = false): boolean {
  return (allowComma ? /^[+-]?([0-9]+([.,][0-9]+)?|[.,][0-9]+)$/ : /^[+-]?([0-9]+([.][0-9]+)?|[.][0-9]+)$/).test(v);
}

export default isNumericText;
